/*
 * @Date: 2025-05-03 22:02:55
 * @LastEditors: hookehuyr hookehuyr@gmail.com
 * @LastEditTime: 2025-05-04 19:57:00
 * @FilePath: /new-sails/config/blueprints.js
 * @Description: 文件描述
 */
/**
 * 蓝图API配置
 * (sails.config.blueprints)
 *
 * 关于Sails中蓝图API的背景信息，请查看：
 * https://sailsjs.com/docs/reference/blueprint-api
 *
 * 更多详细信息和可用选项，请参见：
 * https://sailsjs.com/config/blueprints
 */

module.exports.blueprints = {

  /***************************************************************************
  *                                                                          *
  * 是否为应用中的每个action自动暴露隐式路由？                               *
  *                                                                          *
  ***************************************************************************/

  // actions: false,


  /***************************************************************************
  *                                                                          *
  * 是否为你的模型自动暴露RESTful路由？                                      *
  *                                                                          *
  ***************************************************************************/

  // rest: true,


  /***************************************************************************
  *                                                                          *
  * 是否为GET请求自动暴露CRUD "快捷方式" 路由？                              *
  * （这些路由默认仅在开发环境中启用。）                                      *
  *                                                                          *
  ***************************************************************************/

  // shortcuts: true,

};
